In [1]:
import numpy as np
import pandas as pd

GroupBy

In [2]:
data={
    'category' : ['A', 'A', 'B', 'B', 'C', 'C'],
    'store' : ['X', 'Y', 'X', 'Y', 'X', 'Y'],
    'sales' : [100, 150, 200, 250, 300, 350],
    'Quantity' : [10, 15, 20, 25, 30, 35],
    'date' : pd.date_range('2023-01-01', periods=6, freq='D')
}
df = pd.DataFrame(data)
df

  category store  sales  Quantity       date
0        A     X    100        10 2023-01-01
1        A     Y    150        15 2023-01-02
2        B     X    200        20 2023-01-03
3        B     Y    250        25 2023-01-04
4        C     X    300        30 2023-01-05
5        C     Y    350        35 2023-01-06

In [5]:
#groupby function is used to group the data by one or more columns and perform aggregation on the grouped data
grouped = df.groupby('category')
grouped
for i, val in grouped:
    print(i)
    print(val)

A
  category store  sales  Quantity       date
0        A     X    100        10 2023-01-01
1        A     Y    150        15 2023-01-02
B
  category store  sales  Quantity       date
2        B     X    200        20 2023-01-03
3        B     Y    250        25 2023-01-04
C
  category store  sales  Quantity       date
4        C     X    300        30 2023-01-05
5        C     Y    350        35 2023-01-06

In [ ]:
#to perform aggregation on the grouped data we can use the sum, mean, count, etc. functions
grouped_sum = grouped[['sales', 'Quantity']].sum()
grouped_sum

          sales  Quantity
category
A           250        25
B           450        45
C           650        65

In [8]:
#multiple line groupby
grouped_multi = df.groupby(['category', 'store'])
grouped_multi_sum = grouped_multi[['sales', 'Quantity']].sum()
grouped_multi_sum

                sales  Quantity
category store
A        X        100        10
         Y        150        15
B        X        200        20
         Y        250        25
C        X        300        30
         Y        350        35

Aggregation

In [ ]:
#to perform multiple aggregations on a column we can use the agg function
df['sales'].mean()

np.float64(225.0)

In [ ]:
#to perform multiple aggregations on a column we can use the agg function
df['sales'].agg(['mean', 'sum', 'max', 'min'])

mean     225.0
sum     1350.0
max      350.0
min      100.0
Name: sales, dtype: float64